frontend/artillery.yml
config:
  target: 'http://157.230.138.200:8090/mingesoback'
  payload:
    path: "./usuarios.csv"
    fields:
    - "usuario"
    - "password"
  ensure:
    - median: 60000
    - maxErrorRate: 10
  phases:
  - duration: 60
    arrivalRate: 5
  - duration: 60
    arrivalRate: 5
    rampTo: 20
  environments:
    lowload:
      phases:
      - duration: 20
        arrivalRate: 5
      - duration: 30
        arrivalRate: 6
    highload:
      phases:
      - duration: 60
        arrivalRate: 5
      - duration: 120
        arrivalRate: 10
        rampTo: 50
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - flow:
      - post:
          url: "/usuario/login"
          json:
            usuario: "{{ usuario }}"
            password: "{{ contraseña }}"
      - get:
          url: "/habitaciones"
      - get:
          url: "/reservas"
      - think: 5
      - get:
          url: "/reservas/codigo/A"
      - get:
          url: "/tipos"